using Controllers;
using Models;
using System;
using System.ComponentModel;

namespace LessonCh006
{
    class Program
    {
        static void Print(Ministry ministry)
        {
            BindingList<Worker> workers = ministry.GetListOfAllWorkers();

            if(workers != null)
            {
                for (int i = 0; i < workers.Count; i++)
                {
                    Console.WriteLine($"{workers[i].Name,20} {workers[i].Surname,20} {workers[i].Age,5} {workers[i].Salary,15} {workers[i].JobTitle,45} {workers[i].PathToDepartment}");
                    Console.WriteLine();
                }

                Console.WriteLine("----------------------------------------------------------------------------------------------------------------------------------------------------");
            }            
        }
        
        static void Main(string[] args)
        {           
            Ministry ministry = new Ministry("ОАО Рога и Копыта");

            #region Инициализация и заполнение департаментов

            #region Создание департаментов 

            ministry.AddDepartment("Департамент_0");
            ministry.AddDepartment("Департамент_1");
            ministry.AddDepartment("Департамент_2");
            ministry.AddDepartment("Департамент_3");

            ministry.AddDepartment("Департамент_3/Департамент_3_0");
            ministry.AddDepartment("Департамент_3/Департамент_3_1");
            
            ministry.AddDepartment("Департамент_3/Департамент_3_0/Департамент_3_0_0");
            ministry.AddDepartment("Департамент_3/Департамент_3_0/Департамент_3_0_1");            

            #endregion

            #region Добавление Руководителей Высшего Звена

            ministry.AddGeneralDirector("Иван", "Иванов", 45);
            ministry.AddChiefAccountant("Татьяна", "Сергеева", 47);
            ministry.AddDeputyDirector("Валентин", "Петров", 43);

            #endregion

            #region Заполнение Департамента_0

            ministry.AddEmployee("Имя_Сотрудника", "Фамилия_Сотрудника", 32, 2112, "Сотрудник_Департамента", "Департамент_0");
            ministry.AddEmployee("Имя_Сотрудника", "Фамилия_Сотрудника", 33, 2112, "Сотрудник_Департамента", "Департамент_0");
            ministry.AddEmployee("Имя_Сотрудника", "Фамилия_Сотрудника", 34, 2112, "Сотрудник_Департамента", "Департамент_0");
            ministry.AddEmployee("Имя_Сотрудника", "Фамилия_Сотрудника", 35, 2112, "Сотрудник_Департамента", "Департамент_0");
            ministry.AddEmployee("Имя_Сотрудника", "Фамилия_Сотрудника", 36, 2112, "Сотрудник_Департамента", "Департамент_0");

            ministry.AddIntern("Имя_Интерна", "Фамилия_Интерна", 22, 500, "Интерн_Департамента", "Департамент_0");
            ministry.AddIntern("Имя_Интерна", "Фамилия_Интерна", 23, 500, "Интерн_Департамента", "Департамент_0");
            ministry.AddIntern("Имя_Интерна", "Фамилия_Интерна", 24, 500, "Интерн_Департамента", "Департамент_0");
            ministry.AddIntern("Имя_Интерна", "Фамилия_Интерна", 25, 500, "Интерн_Департамента", "Департамент_0");
            ministry.AddIntern("Имя_Интерна", "Фамилия_Интерна", 26, 500, "Интерн_Департамента", "Департамент_0");

            ministry.AddSupervisorDepartment("Имя_Руководителя", "Фамилия_Руководителя", 27, "Руководитель_Департамента_0", "Департамент_0");

            #endregion

            #region Заполнение Департамента_1

            ministry.AddEmployee("Имя_Сотрудника", "Фамилия_Сотрудника", 32, 2112, "Сотрудник_Департамента", "Департамент_1");
            ministry.AddEmployee("Имя_Сотрудника", "Фамилия_Сотрудника", 33, 2112, "Сотрудник_Департамента", "Департамент_1");
            ministry.AddEmployee("Имя_Сотрудника", "Фамилия_Сотрудника", 34, 2112, "Сотрудник_Департамента", "Департамент_1");
            ministry.AddEmployee("Имя_Сотрудника", "Фамилия_Сотрудника", 35, 2112, "Сотрудник_Департамента", "Департамент_1");
            ministry.AddEmployee("Имя_Сотрудника", "Фамилия_Сотрудника", 36, 2112, "Сотрудник_Департамента", "Департамент_1");

            ministry.AddIntern("Имя_Интерна", "Фамилия_Интерна", 22, 500, "Интерн_Департамента", "Департамент_1");
            ministry.AddIntern("Имя_Интерна", "Фамилия_Интерна", 23, 500, "Интерн_Департамента", "Департамент_1");
            ministry.AddIntern("Имя_Интерна", "Фамилия_Интерна", 24, 500, "Интерн_Департамента", "Департамент_1");
            ministry.AddIntern("Имя_Интерна", "Фамилия_Интерна", 25, 500, "Интерн_Департамента", "Департамент_1");
            ministry.AddIntern("Имя_Интерна", "Фамилия_Интерна", 26, 500, "Интерн_Департамента", "Департамент_1");

            ministry.AddSupervisorDepartment("Имя_Руководителя", "Фамилия_Руководителя", 27, "Руководитель_Департамента_1", "Департамент_1");

            #endregion

            #region Заполнение Департамента_2

            ministry.AddEmployee("Имя_Сотрудника", "Фамилия_Сотрудника", 32, 2112, "Сотрудник_Департамента", "Департамент_2");
            ministry.AddEmployee("Имя_Сотрудника", "Фамилия_Сотрудника", 33, 2112, "Сотрудник_Департамента", "Департамент_2");
            ministry.AddEmployee("Имя_Сотрудника", "Фамилия_Сотрудника", 34, 2112, "Сотрудник_Департамента", "Департамент_2");
            ministry.AddEmployee("Имя_Сотрудника", "Фамилия_Сотрудника", 35, 2112, "Сотрудник_Департамента", "Департамент_2");
            ministry.AddEmployee("Имя_Сотрудника", "Фамилия_Сотрудника", 36, 2112, "Сотрудник_Департамента", "Департамент_2");

            ministry.AddIntern("Имя_Интерна", "Фамилия_Интерна", 22, 500, "Интерн_Департамента", "Департамент_2");
            ministry.AddIntern("Имя_Интерна", "Фамилия_Интерна", 23, 500, "Интерн_Департамента", "Департамент_2");
            ministry.AddIntern("Имя_Интерна", "Фамилия_Интерна", 24, 500, "Интерн_Департамента", "Департамент_2");
            ministry.AddIntern("Имя_Интерна", "Фамилия_Интерна", 25, 500, "Интерн_Департамента", "Департамент_2");
            ministry.AddIntern("Имя_Интерна", "Фамилия_Интерна", 26, 500, "Интерн_Департамента", "Департамент_2");

            ministry.AddSupervisorDepartment("Имя_Руководителя", "Фамилия_Руководителя", 27, "Руководитель_Департамента_2", "Департамент_2");

            #endregion

            #region Заполнение Департамента_3

            ministry.AddEmployee("Имя_Сотрудника", "Фамилия_Сотрудника", 32, 2112, "Сотрудник_Департамента", "Департамент_3");
            ministry.AddEmployee("Имя_Сотрудника", "Фамилия_Сотрудника", 33, 2112, "Сотрудник_Департамента", "Департамент_3");
            ministry.AddEmployee("Имя_Сотрудника", "Фамилия_Сотрудника", 34, 2112, "Сотрудник_Департамента", "Департамент_3");
            ministry.AddEmployee("Имя_Сотрудника", "Фамилия_Сотрудника", 35, 2112, "Сотрудник_Департамента", "Департамент_3");
            ministry.AddEmployee("Имя_Сотрудника", "Фамилия_Сотрудника", 36, 2112, "Сотрудник_Департамента", "Департамент_3");

            ministry.AddIntern("Имя_Интерна", "Фамилия_Интерна", 22, 500, "Интерн_Департамента", "Департамент_3");
            ministry.AddIntern("Имя_Интерна", "Фамилия_Интерна", 23, 500, "Интерн_Департамента", "Департамент_3");
            ministry.AddIntern("Имя_Интерна", "Фамилия_Интерна", 24, 500, "Интерн_Департамента", "Департамент_3");
            ministry.AddIntern("Имя_Интерна", "Фамилия_Интерна", 25, 500, "Интерн_Департамента", "Департамент_3");
            ministry.AddIntern("Имя_Интерна", "Фамилия_Интерна", 26, 500, "Интерн_Департамента", "Департамент_3");

            ministry.AddSupervisorDepartment("Имя_Руководителя", "Фамилия_Руководителя", 35, "Руководитель_Департамента_3", "Департамент_3");

            #endregion

            #region Заполнение Департамента_3_0

            ministry.AddEmployee("Имя_Сотрудника", "Фамилия_Сотрудника", 32, 2112, "Сотрудник_Департамента", "Департамент_3/Департамент_3_0");
            ministry.AddEmployee("Имя_Сотрудника", "Фамилия_Сотрудника", 33, 2112, "Сотрудник_Департамента", "Департамент_3/Департамент_3_0");
            ministry.AddEmployee("Имя_Сотрудника", "Фамилия_Сотрудника", 34, 2112, "Сотрудник_Департамента", "Департамент_3/Департамент_3_0");
            ministry.AddEmployee("Имя_Сотрудника", "Фамилия_Сотрудника", 35, 2112, "Сотрудник_Департамента", "Департамент_3/Департамент_3_0");
            ministry.AddEmployee("Имя_Сотрудника", "Фамилия_Сотрудника", 36, 2112, "Сотрудник_Департамента", "Департамент_3/Департамент_3_0");

            ministry.AddIntern("Имя_Интерна", "Фамилия_Интерна", 22, 500, "Интерн_Департамента", "Департамент_3/Департамент_3_0");
            ministry.AddIntern("Имя_Интерна", "Фамилия_Интерна", 23, 500, "Интерн_Департамента", "Департамент_3/Департамент_3_0");
            ministry.AddIntern("Имя_Интерна", "Фамилия_Интерна", 24, 500, "Интерн_Департамента", "Департамент_3/Департамент_3_0");
            ministry.AddIntern("Имя_Интерна", "Фамилия_Интерна", 25, 500, "Интерн_Департамента", "Департамент_3/Департамент_3_0");
            ministry.AddIntern("Имя_Интерна", "Фамилия_Интерна", 26, 500, "Интерн_Департамента", "Департамент_3/Департамент_3_0");

            ministry.AddSupervisorDepartment("Имя_Руководителя", "Фамилия_Руководителя", 35, "Руководитель_Департамента_3_0", "Департамент_3/Департамент_3_0");

            #endregion

            #region Заполнение Департамента_3_1

            ministry.AddEmployee("Имя_Сотрудника", "Фамилия_Сотрудника", 32, 2112, "Сотрудник_Департамента", "Департамент_3/Департамент_3_1");
            ministry.AddEmployee("Имя_Сотрудника", "Фамилия_Сотрудника", 33, 2112, "Сотрудник_Департамента", "Департамент_3/Департамент_3_1");
            ministry.AddEmployee("Имя_Сотрудника", "Фамилия_Сотрудника", 34, 2112, "Сотрудник_Департамента", "Департамент_3/Департамент_3_1");
            ministry.AddEmployee("Имя_Сотрудника", "Фамилия_Сотрудника", 35, 2112, "Сотрудник_Департамента", "Департамент_3/Департамент_3_1");
            ministry.AddEmployee("Имя_Сотрудника", "Фамилия_Сотрудника", 36, 2112, "Сотрудник_Департамента", "Департамент_3/Департамент_3_1");

            ministry.AddIntern("Имя_Интерна", "Фамилия_Интерна", 22, 500, "Интерн_Департамента", "Департамент_3/Департамент_3_1");
            ministry.AddIntern("Имя_Интерна", "Фамилия_Интерна", 23, 500, "Интерн_Департамента", "Департамент_3/Департамент_3_1");
            ministry.AddIntern("Имя_Интерна", "Фамилия_Интерна", 24, 500, "Интерн_Департамента", "Департамент_3/Департамент_3_1");
            ministry.AddIntern("Имя_Интерна", "Фамилия_Интерна", 25, 500, "Интерн_Департамента", "Департамент_3/Департамент_3_1");
            ministry.AddIntern("Имя_Интерна", "Фамилия_Интерна", 26, 500, "Интерн_Департамента", "Департамент_3/Департамент_3_1");

            ministry.AddSupervisorDepartment("Имя_Руководителя", "Фамилия_Руководителя", 35, "Руководитель_Департамента_3_1", "Департамент_3/Департамент_3_1");

            #endregion

            #region Заполнение Департамента_3_0_0

            ministry.AddEmployee("Имя_Сотрудника", "Фамилия_Сотрудника", 32, 2112, "Сотрудник_Департамента", "Департамент_3/Департамент_3_0/Департамент_3_0_0");
            ministry.AddEmployee("Имя_Сотрудника", "Фамилия_Сотрудника", 33, 2112, "Сотрудник_Департамента", "Департамент_3/Департамент_3_0/Департамент_3_0_0");
            ministry.AddEmployee("Имя_Сотрудника", "Фамилия_Сотрудника", 34, 2112, "Сотрудник_Департамента", "Департамент_3/Департамент_3_0/Департамент_3_0_0");
            ministry.AddEmployee("Имя_Сотрудника", "Фамилия_Сотрудника", 35, 2112, "Сотрудник_Департамента", "Департамент_3/Департамент_3_0/Департамент_3_0_0");
            ministry.AddEmployee("Имя_Сотрудника", "Фамилия_Сотрудника", 36, 2112, "Сотрудник_Департамента", "Департамент_3/Департамент_3_0/Департамент_3_0_0");

            ministry.AddIntern("Имя_Интерна", "Фамилия_Интерна", 22, 500, "Интерн_Департамента", "Департамент_3/Департамент_3_0/Департамент_3_0_0");
            ministry.AddIntern("Имя_Интерна", "Фамилия_Интерна", 23, 500, "Интерн_Департамента", "Департамент_3/Департамент_3_0/Департамент_3_0_0");
            ministry.AddIntern("Имя_Интерна", "Фамилия_Интерна", 24, 500, "Интерн_Департамента", "Департамент_3/Департамент_3_0/Департамент_3_0_0");
            ministry.AddIntern("Имя_Интерна", "Фамилия_Интерна", 25, 500, "Интерн_Департамента", "Департамент_3/Департамент_3_0/Департамент_3_0_0");
            ministry.AddIntern("Имя_Интерна", "Фамилия_Интерна", 26, 500, "Интерн_Департамента", "Департамент_3/Департамент_3_0/Департамент_3_0_0");

            ministry.AddSupervisorDepartment("Имя_Руководителя", "Фамилия_Руководителя", 35, "Руководитель_Департамента_3_0_0", "Департамент_3/Департамент_3_0/Департамент_3_0_0");

            #endregion

            #region Заполнение Департамента_3_0_1

            ministry.AddEmployee("Имя_Сотрудника", "Фамилия_Сотрудника", 32, 2112, "Сотрудник_Департамента", "Департамент_3/Департамент_3_0/Департамент_3_0_1");
            ministry.AddEmployee("Имя_Сотрудника", "Фамилия_Сотрудника", 33, 2112, "Сотрудник_Департамента", "Департамент_3/Департамент_3_0/Департамент_3_0_1");
            ministry.AddEmployee("Имя_Сотрудника", "Фамилия_Сотрудника", 34, 2112, "Сотрудник_Департамента", "Департамент_3/Департамент_3_0/Департамент_3_0_1");
            ministry.AddEmployee("Имя_Сотрудника", "Фамилия_Сотрудника", 35, 2112, "Сотрудник_Департамента", "Департамент_3/Департамент_3_0/Департамент_3_0_1");
            ministry.AddEmployee("Имя_Сотрудника", "Фамилия_Сотрудника", 36, 2112, "Сотрудник_Департамента", "Департамент_3/Департамент_3_0/Департамент_3_0_1");

            ministry.AddIntern("Имя_Интерна", "Фамилия_Интерна", 22, 500, "Интерн_Департамента", "Департамент_3/Департамент_3_0/Департамент_3_0_1");
            ministry.AddIntern("Имя_Интерна", "Фамилия_Интерна", 23, 500, "Интерн_Департамента", "Департамент_3/Департамент_3_0/Департамент_3_0_1");
            ministry.AddIntern("Имя_Интерна", "Фамилия_Интерна", 24, 500, "Интерн_Департамента", "Департамент_3/Департамент_3_0/Департамент_3_0_1");
            ministry.AddIntern("Имя_Интерна", "Фамилия_Интерна", 25, 500, "Интерн_Департамента", "Департамент_3/Департамент_3_0/Департамент_3_0_1");
            ministry.AddIntern("Имя_Интерна", "Фамилия_Интерна", 26, 500, "Интерн_Департамента", "Департамент_3/Департамент_3_0/Департамент_3_0_1");

            ministry.AddSupervisorDepartment("Имя_Руководителя", "Фамилия_Руководителя", 35, "Руководитель_Департамента_3_0_1", "Департамент_3/Департамент_3_0/Департамент_3_0_1");

            #endregion

            #endregion

            Print(ministry);
            Console.ReadKey();


            #region Удаление департамента

            ministry.DeleteDepartment("Департамент_3/Департамент_3_0/Департамент_3_0_0");

            #endregion

            Print(ministry);
            Console.ReadKey();
            Console.Clear();

            #region Добавление Сотрудников

            ministry.AddEmployee("Василий", "Пупкин", 33, 2112, "Программист", "Департамент_3/Департамент_3_1");
            ministry.AddIntern("Иван", "Задов", 21, 500, "Помощник программиста", "Департамент_3/Департамент_3_1");

            #endregion

            Print(ministry);
            Console.ReadKey();

            #region Удаление сотрудников

            ministry.DeleteEmployee("Василий", "Пупкин", 33, 2112, "Программист", "Департамент_3/Департамент_3_1");
            ministry.DeleteIntern("Иван", "Задов", 21, 500, "Помощник программиста", "Департамент_3/Департамент_3_1");

            #endregion

            Print(ministry);
            Console.ReadKey();
            Console.Clear();

        }
    }
}
