using Controllers;
using Models;
using System;

namespace LessonCh006
{
    class Program
    {
        static void PrintDepartment(Department department, int number)
        {
            if(department.CountDepartments != 0)
            {
                for(int i = 0; i < department.CountDepartments; i++)
                {
                    PrintDepartment(department.NextDepartments[i], number + 5);
                }
            }
            
            Console.WriteLine($"---------------------------------------------{department.Path}-------------------------------------------------------------------------------------");

            Console.WriteLine("----------------------------------------------------------------------------------------------------------------------------------------------------");

            if (department.Supervisor != null)
            {
                Console.WriteLine($"{department.Supervisor.Name, 20} {department.Supervisor.Surname, 20} {department.Supervisor.Age, 5} {department.Supervisor.Salary, 15} {department.Supervisor.JobTitle, 45}");
                Console.WriteLine();
            }

            Console.WriteLine("----------------------------------------------------------------------------------------------------------------------------------------------------");
            
            if (department.CountWorkers != 0)
            {
                for (int i = 0; i < department.CountWorkers; i++)
                {
                    Console.WriteLine($"{department.Workers[i].Name, 20} {department.Workers[i].Surname, 20} {department.Workers[i].Age, 5} {department.Workers[i].Salary, 15} {department.Workers[i].JobTitle, 45}");
                    Console.WriteLine();
                }

                Console.WriteLine("--------------------------------------------------------------------------------------------------------------------------------------------------");
            }
        }

        static void Print(Company company)
        {
            if(company.GeneralDirector != null)
            {
                Console.WriteLine($"{company.GeneralDirector.Name,20} {company.GeneralDirector.Surname,20} {company.GeneralDirector.Age,5} {company.GeneralDirector.Salary,15} {company.GeneralDirector.JobTitle,45}");
                Console.WriteLine();
            }

            Console.WriteLine("--------------------------------------------------------------------------------------------------------------------------------------------------");

            if (company.DeputyDirector != null)
            {
                Console.WriteLine($"{company.DeputyDirector.Name,20} {company.DeputyDirector.Surname,20} {company.DeputyDirector.Age,5} {company.DeputyDirector.Salary,15} {company.DeputyDirector.JobTitle,45}");
                Console.WriteLine();
            }

            Console.WriteLine("--------------------------------------------------------------------------------------------------------------------------------------------------");

            if (company.ChiefAccountant != null)
            {
                Console.WriteLine($"{company.ChiefAccountant.Name,20} {company.ChiefAccountant.Surname,20} {company.ChiefAccountant.Age,5} {company.ChiefAccountant.Salary,15} {company.ChiefAccountant.JobTitle,45}");
                Console.WriteLine();
            }

            Console.WriteLine("--------------------------------------------------------------------------------------------------------------------------------------------------");
            Console.WriteLine();

            for (int i = 0; i < company.Departments.Count; i++)
            {
                PrintDepartment(company.Departments[i], 0);
            }
        }
        
        static void Main(string[] args)
        {
            Company company = new Company("ОАО Рога и Копыта");

            #region Заполнение компании

            //#region Создание департаментов 

            //company.AddDepartment("Департамент_0");
            //company.AddDepartment("Департамент_1");
            //company.AddDepartment("Департамент_2");
            //company.AddDepartment("Департамент_3");
            //company.AddDepartment("Департамент_4");
            //company.AddDepartment("Департамент_5");

            //company.AddDepartment("Департамент_1/Департамент_1_0");
            //company.AddDepartment("Департамент_1/Департамент_1_1");
            //company.AddDepartment("Департамент_2/Департамент_2_0/Департамент_2_0_0");
            //company.AddDepartment("Департамент_3/Департамент_3_0/Департамент_3_0_0/Департамент_3_0_0_0");

            //#endregion

            //#region Добавление Руководителей Высшего Звена

            //company.AddGeneralDirector("Иван", "Иванов", 45);
            //company.AddChiefAccountant("Татьяна", "Сергеева", 47);
            //company.AddDeputyDirector("Валентин", "Петров", 43);

            //#endregion

            //#region Добавление работников

            ////----------------------------------------Департамент_0---------------------------------------------------------------

            //company.AddSupervisorDepartment("Юрий", "Мелькин", 45, "Начальник департамента", "Департамент_0");

            //company.AddIntern("Иван", "Петров", 25, 500, "Помощник программиста", "Департамент_0");
            //company.AddIntern("Михаил", "Иванов", 26, 500, "Помощник программиста", "Департамент_0");
            //company.AddIntern("Кирилл", "Сидоров", 27, 500, "Помощник программиста", "Департамент_0");
            //company.AddEmployee("Алексей", "Пивоваров", 35, 1000, "Программист", "Департамент_0");
            //company.AddEmployee("Исламбек", "Казаев", 39, 1000, "Программист", "Департамент_0");
            //company.AddEmployee("Исламбек", "Казаев", 39, 1000, "Программист", "Департамент_0");

            ////----------------------------------------Департамент_1---------------------------------------------------------------

            //company.AddSupervisorDepartment("Игорь", "Максимов", 41, "Начальник департамента", "Департамент_1");

            //company.AddEmployee("Павел", "Петренко", 36, 1000, "Программист", "Департамент_1");
            //company.AddEmployee("Семён", "Самохин", 37, 1000, "Программист", "Департамент_1");
            //company.AddEmployee("Аримат", "Кузбеков", 38, 1000, "Программист", "Департамент_1");
            //company.AddIntern("Игорь", "Матросов", 28, 500, "Помощник программиста", "Департамент_1");
            //company.AddIntern("Иван", "Кажедуб", 29, 500, "Помощник программиста", "Департамент_1");
            //company.AddIntern("Иван", "Петров", 25, 500, "Помощник программиста", "Департамент_1");

            ////----------------------------------------Департамент_2---------------------------------------------------------------

            //company.AddSupervisorDepartment("Семён", "Маков", 35, "Начальник департамента", "Департамент_2");

            //company.AddEmployee("Павел", "Петренко", 36, 1000, "Программист", "Департамент_2");
            //company.AddEmployee("Семён", "Самохин", 37, 1000, "Программист", "Департамент_2");
            //company.AddEmployee("Аримат", "Кузбеков", 38, 1000, "Программист", "Департамент_2");
            //company.AddIntern("Игорь", "Матросов", 28, 500, "Помощник программиста", "Департамент_2");
            //company.AddIntern("Иван", "Кажедуб", 29, 500, "Помощник программиста", "Департамент_2");
            //company.AddIntern("Иван", "Петров", 25, 500, "Помощник программиста", "Департамент_2");

            ////----------------------------------------Департамент_3---------------------------------------------------------------

            //company.AddSupervisorDepartment("Иван", "Иванов", 33, "Начальник департамента", "Департамент_3");

            //company.AddEmployee("Павел", "Петренко", 36, 1000, "Программист", "Департамент_3");
            //company.AddEmployee("Семён", "Самохин", 37, 1000, "Программист", "Департамент_3");
            //company.AddEmployee("Аримат", "Кузбеков", 38, 1000, "Программист", "Департамент_3");
            //company.AddIntern("Игорь", "Матросов", 28, 500, "Помощник программиста", "Департамент_3");
            //company.AddIntern("Иван", "Кажедуб", 29, 500, "Помощник программиста", "Департамент_3");
            //company.AddIntern("Иван", "Петров", 25, 500, "Помощник программиста", "Департамент_3");

            ////----------------------------------------Департамент_4---------------------------------------------------------------

            //company.AddSupervisorDepartment("Михаил", "Сидоров", 49, "Начальник департамента", "Департамент_4");

            //company.AddEmployee("Павел", "Петренко", 36, 1000, "Программист", "Департамент_4");
            //company.AddEmployee("Семён", "Самохин", 37, 1000, "Программист", "Департамент_4");
            //company.AddEmployee("Аримат", "Кузбеков", 38, 1000, "Программист", "Департамент_4");
            //company.AddIntern("Игорь", "Матросов", 28, 500, "Помощник программиста", "Департамент_4");
            //company.AddIntern("Иван", "Кажедуб", 29, 500, "Помощник программиста", "Департамент_4");
            //company.AddIntern("Иван", "Петров", 25, 500, "Помощник программиста", "Департамент_4");

            ////----------------------------------------Департамент_5---------------------------------------------------------------

            //company.AddSupervisorDepartment("Пётр", "Петров", 37, "Начальник департамента", "Департамент_5");

            //company.AddEmployee("Павел", "Петренко", 36, 1000, "Программист", "Департамент_5");
            //company.AddEmployee("Семён", "Самохин", 37, 1000, "Программист", "Департамент_5");
            //company.AddEmployee("Аримат", "Кузбеков", 38, 1000, "Программист", "Департамент_5");
            //company.AddIntern("Игорь", "Матросов", 28, 500, "Помощник программиста", "Департамент_5");
            //company.AddIntern("Иван", "Кажедуб", 29, 500, "Помощник программиста", "Департамент_5");
            //company.AddIntern("Иван", "Петров", 25, 500, "Помощник программиста", "Департамент_5");

            ////----------------------------------------Департамент_1/Департамент_1_0---------------------------------------------------------------

            //company.AddSupervisorDepartment("Пётр", "Петров", 37, "Начальник департамента", "Департамент_1/Департамент_1_0");

            //company.AddEmployee("Павел", "Петренко", 36, 1000, "Программист", "Департамент_1/Департамент_1_0");
            //company.AddEmployee("Семён", "Самохин", 37, 1000, "Программист", "Департамент_1/Департамент_1_0");
            //company.AddEmployee("Аримат", "Кузбеков", 38, 1000, "Программист", "Департамент_1/Департамент_1_0");
            //company.AddIntern("Игорь", "Матросов", 28, 500, "Помощник программиста", "Департамент_1/Департамент_1_0");
            //company.AddIntern("Иван", "Кажедуб", 29, 500, "Помощник программиста", "Департамент_1/Департамент_1_0");
            //company.AddIntern("Иван", "Петров", 25, 500, "Помощник программиста", "Департамент_1/Департамент_1_0");

            ////----------------------------------------Департамент_1/Департамент_1_1---------------------------------------------------------------

            //company.AddSupervisorDepartment("Сергей", "Иванов", 39, "Начальник департамента", "Департамент_1/Департамент_1_1");

            //company.AddEmployee("Павел", "Петренко", 36, 1000, "Программист", "Департамент_1/Департамент_1_1");
            //company.AddEmployee("Семён", "Самохин", 37, 1000, "Программист", "Департамент_1/Департамент_1_1");
            //company.AddEmployee("Аримат", "Кузбеков", 38, 1000, "Программист", "Департамент_1/Департамент_1_1");
            //company.AddIntern("Игорь", "Матросов", 28, 500, "Помощник программиста", "Департамент_1/Департамент_1_1");
            //company.AddIntern("Иван", "Кажедуб", 29, 500, "Помощник программиста", "Департамент_1/Департамент_1_1");
            //company.AddIntern("Иван", "Петров", 25, 500, "Помощник программиста", "Департамент_1/Департамент_1_1");

            ////---------------------------------------Департамент_2/Департамент_2_0-------------------------------------------------------------------------------

            //company.AddSupervisorDepartment("Пётр", "Петров", 37, "Начальник департамента", "Департамент_2/Департамент_2_0");

            //company.AddEmployee("Павел", "Петренко", 36, 1000, "Программист", "Департамент_2/Департамент_2_0");
            //company.AddEmployee("Семён", "Самохин", 37, 1000, "Программист", "Департамент_2/Департамент_2_0");
            //company.AddEmployee("Аримат", "Кузбеков", 38, 1000, "Программист", "Департамент_2/Департамент_2_0");
            //company.AddIntern("Игорь", "Матросов", 28, 500, "Помощник программиста", "Департамент_2/Департамент_2_0");
            //company.AddIntern("Иван", "Кажедуб", 29, 500, "Помощник программиста", "Департамент_2/Департамент_2_0");
            //company.AddIntern("Иван", "Петров", 25, 500, "Помощник программиста", "Департамент_2/Департамент_2_0");

            ////-------------------------------------Департамент_3/Департамент_3_0--------------------------------------------------------------------------------

            //company.AddSupervisorDepartment("Пётр", "Петров", 37, "Начальник департамента", "Департамент_3/Департамент_3_0");

            //company.AddEmployee("Павел", "Петренко", 36, 1000, "Программист", "Департамент_3/Департамент_3_0");
            //company.AddEmployee("Семён", "Самохин", 37, 1000, "Программист", "Департамент_3/Департамент_3_0");
            //company.AddEmployee("Аримат", "Кузбеков", 38, 1000, "Программист", "Департамент_3/Департамент_3_0");
            //company.AddIntern("Игорь", "Матросов", 28, 500, "Помощник программиста", "Департамент_3/Департамент_3_0");
            //company.AddIntern("Иван", "Кажедуб", 29, 500, "Помощник программиста", "Департамент_3/Департамент_3_0");
            //company.AddIntern("Иван", "Петров", 25, 500, "Помощник программиста", "Департамент_3/Департамент_3_0");

            ////-----------------------------------Департамент_2/Департамент_2_0/Департамент_2_0_0---------------------------------------------------------------

            //company.AddSupervisorDepartment("Пётр", "Петров", 37, "Начальник департамента", "Департамент_2/Департамент_2_0/Департамент_2_0_0");

            //company.AddEmployee("Павел", "Петренко", 36, 1000, "Программист", "Департамент_2/Департамент_2_0/Департамент_2_0_0");
            //company.AddEmployee("Семён", "Самохин", 37, 1000, "Программист", "Департамент_2/Департамент_2_0/Департамент_2_0_0");
            //company.AddEmployee("Аримат", "Кузбеков", 38, 1000, "Программист", "Департамент_2/Департамент_2_0/Департамент_2_0_0");
            //company.AddIntern("Игорь", "Матросов", 28, 500, "Помощник программиста", "Департамент_2/Департамент_2_0/Департамент_2_0_0");
            //company.AddIntern("Иван", "Кажедуб", 29, 500, "Помощник программиста", "Департамент_2/Департамент_2_0/Департамент_2_0_0");
            //company.AddIntern("Иван", "Петров", 25, 500, "Помощник программиста", "Департамент_2/Департамент_2_0/Департамент_2_0_0");

            ////----------------------------------Департамент_3/Департамент_3_0/Департамент_3_0_0---------------------------------------------------------------

            //company.AddSupervisorDepartment("Пётр", "Петров", 37, "Начальник департамента", "Департамент_3/Департамент_3_0/Департамент_3_0_0");

            //company.AddEmployee("Павел", "Петренко", 36, 1000, "Программист", "Департамент_3/Департамент_3_0/Департамент_3_0_0");
            //company.AddEmployee("Семён", "Самохин", 37, 1000, "Программист", "Департамент_3/Департамент_3_0/Департамент_3_0_0");
            //company.AddEmployee("Аримат", "Кузбеков", 38, 1000, "Программист", "Департамент_3/Департамент_3_0/Департамент_3_0_0");
            //company.AddIntern("Игорь", "Матросов", 28, 500, "Помощник программиста", "Департамент_3/Департамент_3_0/Департамент_3_0_0");
            //company.AddIntern("Иван", "Кажедуб", 29, 500, "Помощник программиста", "Департамент_3/Департамент_3_0/Департамент_3_0_0");
            //company.AddIntern("Иван", "Петров", 25, 500, "Помощник программиста", "Департамент_3/Департамент_3_0/Департамент_3_0_0");

            ////--------------------------------Департамент_3/Департамент_3_0/Департамент_3_0_0/Департамент_3_0_0_0---------------------------------------------

            //company.AddSupervisorDepartment("Пётр", "Петров", 37, "Начальник департамента", "Департамент_3/Департамент_3_0/Департамент_3_0_0/Департамент_3_0_0_0");

            //company.AddEmployee("Павел", "Петренко", 36, 1000, "Программист", "Департамент_3/Департамент_3_0/Департамент_3_0_0/Департамент_3_0_0_0");
            //company.AddEmployee("Семён", "Самохин", 37, 1000, "Программист", "Департамент_3/Департамент_3_0/Департамент_3_0_0/Департамент_3_0_0_0");
            //company.AddEmployee("Аримат", "Кузбеков", 38, 1000, "Программист", "Департамент_3/Департамент_3_0/Департамент_3_0_0/Департамент_3_0_0_0");
            //company.AddIntern("Игорь", "Матросов", 28, 500, "Помощник программиста", "Департамент_3/Департамент_3_0/Департамент_3_0_0/Департамент_3_0_0_0");
            //company.AddIntern("Иван", "Кажедуб", 29, 500, "Помощник программиста", "Департамент_3/Департамент_3_0/Департамент_3_0_0/Департамент_3_0_0_0");
            //company.AddIntern("Иван", "Петров", 25, 500, "Помощник программиста", "Департамент_3/Департамент_3_0/Департамент_3_0_0/Департамент_3_0_0_0");

            //#endregion

            #endregion

            Print(company);

            Console.ReadKey();
        }
    }
}
