using Controllers;

namespace LessonCh006
{
    class Program
    {
        static void Main(string[] args)
        {           
            Ministry ministry = new Ministry("ОАО Рога и Копыта");

            //------------------------------------------------------------------------------------------------

            ministry.AddDepartment("Департамент_0");
            ministry.AddDepartment("Департамент_1");
            ministry.AddDepartment("Департамент_2");
            ministry.AddDepartment("Департамент_3");

            ministry.AddDepartment("Департамент_3/Департамент_3_0");
            ministry.AddDepartment("Департамент_3/Департамент_3_1");
            ministry.AddDepartment("Департамент_3/Департамент_3_2");
            ministry.AddDepartment("Департамент_3/Департамент_3_3");

            ministry.AddDepartment("Департамент_3/Департамент_3_0/Департамент_3_0_0");
            ministry.AddDepartment("Департамент_3/Департамент_3_0/Департамент_3_0_1");           

            ////------------------------------------------------------------------------------------------------

            ministry.AddGeneralDirector("Иван", "Иванов", 45);
            ministry.AddChiefAccountant("Татьяна", "Сергеева", 47);
            ministry.AddDeputyDirector("Валентин", "Петров", 43);

            ////------------------------------------------------------------------------------------------------

            ministry.AddEmployee("Имя_Сотрудника", "Фамилия_Сотрудника", 32, 2112, "Сотрудник_Департамента", "Департамент_3");
            ministry.AddEmployee("Имя_Сотрудника", "Фамилия_Сотрудника", 33, 2112, "Сотрудник_Департамента", "Департамент_3");
            ministry.AddEmployee("Имя_Сотрудника", "Фамилия_Сотрудника", 34, 2112, "Сотрудник_Департамента", "Департамент_3");
            ministry.AddEmployee("Имя_Сотрудника", "Фамилия_Сотрудника", 35, 2112, "Сотрудник_Департамента", "Департамент_3");
            ministry.AddEmployee("Имя_Сотрудника", "Фамилия_Сотрудника", 36, 2112, "Сотрудник_Департамента", "Департамент_3");

            ministry.AddIntern("Имя_Интерна", "Фамилия_Интерна", 22, 500, "Интерн_Департамента", "Департамент_3");
            ministry.AddIntern("Имя_Интерна", "Фамилия_Интерна", 23, 500, "Интерн_Департамента", "Департамент_3");
            ministry.AddIntern("Имя_Интерна", "Фамилия_Интерна", 24, 500, "Интерн_Департамента", "Департамент_3");
            ministry.AddIntern("Имя_Интерна", "Фамилия_Интерна", 25, 500, "Интерн_Департамента", "Департамент_3");
            ministry.AddIntern("Имя_Интерна", "Фамилия_Интерна", 26, 500, "Интерн_Департамента", "Департамент_3");

            ministry.AddSupervisorDepartment("Имя_Руководителя", "Фамилия_Руководителя", 27, "Руководитель_Департамента", "Департамент_3");

            ////--------------------------------------------------------------------------------------------------------------------------------

            ministry.AddEmployee("Имя_Сотрудника", "Фамилия_Сотрудника", 32, 2112, "Сотрудник_Департамента", "Департамент_3/Департамент_3_0");
            ministry.AddEmployee("Имя_Сотрудника", "Фамилия_Сотрудника", 33, 2112, "Сотрудник_Департамента", "Департамент_3/Департамент_3_0");
            ministry.AddEmployee("Имя_Сотрудника", "Фамилия_Сотрудника", 34, 2112, "Сотрудник_Департамента", "Департамент_3/Департамент_3_0");
            ministry.AddEmployee("Имя_Сотрудника", "Фамилия_Сотрудника", 35, 2112, "Сотрудник_Департамента", "Департамент_3/Департамент_3_0");
            ministry.AddEmployee("Имя_Сотрудника", "Фамилия_Сотрудника", 36, 2112, "Сотрудник_Департамента", "Департамент_3/Департамент_3_0");

            ministry.AddIntern("Имя_Интерна", "Фамилия_Интерна", 22, 500, "Интерн_Департамента", "Департамент_3/Департамент_3_0");
            ministry.AddIntern("Имя_Интерна", "Фамилия_Интерна", 23, 500, "Интерн_Департамента", "Департамент_3/Департамент_3_0");
            ministry.AddIntern("Имя_Интерна", "Фамилия_Интерна", 24, 500, "Интерн_Департамента", "Департамент_3/Департамент_3_0");
            ministry.AddIntern("Имя_Интерна", "Фамилия_Интерна", 25, 500, "Интерн_Департамента", "Департамент_3/Департамент_3_0");
            ministry.AddIntern("Имя_Интерна", "Фамилия_Интерна", 26, 500, "Интерн_Департамента", "Департамент_3/Департамент_3_0");

            ministry.AddSupervisorDepartment("Имя_Руководителя", "Фамилия_Руководителя", 35, "Руководитель_Департамента", "Департамент_3/Департамент_3_0");

            ////---------------------------------------------------------------------------------------------------------------------------------

            //ministry.AddEmployee("Имя_Сотрудника", "Фамилия_Сотрудника", 32, 50000, "Сотрудник_Департамента", "Департамент_3/Департамент_3_0/Департамент_3_0_1");
            //ministry.AddEmployee("Имя_Сотрудника", "Фамилия_Сотрудника", 33, 60000, "Сотрудник_Департамента", "Департамент_3/Департамент_3_0/Департамент_3_0_1");
            //ministry.AddEmployee("Имя_Сотрудника", "Фамилия_Сотрудника", 34, 70000, "Сотрудник_Департамента", "Департамент_3/Департамент_3_0/Департамент_3_0_1");
            //ministry.AddEmployee("Имя_Сотрудника", "Фамилия_Сотрудника", 35, 80000, "Сотрудник_Департамента", "Департамент_3/Департамент_3_0/Департамент_3_0_1");
            //ministry.AddEmployee("Имя_Сотрудника", "Фамилия_Сотрудника", 36, 90000, "Сотрудник_Департамента", "Департамент_3/Департамент_3_0/Департамент_3_0_1");

            //ministry.AddIntern("Имя_Интерна", "Фамилия_Интерна", 22, 20000, "Интерн_Департамента", "Департамент_3/Департамент_3_0/Департамент_3_0_1");
            //ministry.AddIntern("Имя_Интерна", "Фамилия_Интерна", 23, 30000, "Интерн_Департамента", "Департамент_3/Департамент_3_0/Департамент_3_0_1");
            //ministry.AddIntern("Имя_Интерна", "Фамилия_Интерна", 24, 40000, "Интерн_Департамента", "Департамент_3/Департамент_3_0/Департамент_3_0_1");
            //ministry.AddIntern("Имя_Интерна", "Фамилия_Интерна", 25, 50000, "Интерн_Департамента", "Департамент_3/Департамент_3_0/Департамент_3_0_1");
            //ministry.AddIntern("Имя_Интерна", "Фамилия_Интерна", 26, 60000, "Интерн_Департамента", "Департамент_3/Департамент_3_0/Департамент_3_0_1");

            //ministry.AddSupervisorDepartment("Имя_Руководителя", "Фамилия_Руководителя", 35, "Руководитель_Департамента", "Департамент_3/Департамент_3_0/Департамент_3_0_1");

            //----------------------------------------------------------------------------------------------------------------------------------             
        }
    }
}
